# 최대 길이 [가로:세로]: [80,70]
# [30:70] :

# v = [60, 30, 60, 80]
# h = [50, 70, 30, 40]

# a = [80, 40]
# b = [30, 70]
# [[10, 7], [12, 3], [8, 15], [14, 7], [5, 15]]

# 10 12 8 14 5
# 7 3 15 7 15

# # 각 최대값을 곱해주기
# 10 12 15 14 15
# 7 3 8 7 5


sizes = [[60, 50], [30, 70], [60, 30], [80, 40]]
result = 4000
# # 최대 길이 [가로:세로]: [80,70]
# # h: 가로/ v: 세로
# h = [i[0] for i in sizes]
# v = [i[1] for i in sizes]

# # 복사본,,?
# h2 = h
# v2 = v

h3 = []
v3 = []
for i in sizes:
    print(i[0])
    if int(i[0]) < int(i[1]):
        h3.append(i[1])
        v3.append(i[0])
    elif int(i[0]) >= int(i[1]):
        v3.append[i[1]]
        h3.append(i[0])
print(h3)
print(v3)

# if h[0] < v[0]:
#     h2[0] = v[0]
#     v2[0] = h[0]
